local PACKAGE_NAME = "snacks"

-- Command to make arts
-- chafa --size=60x40 --colors=none --symbols=narrow picture.png
local left_art = [[
                                                           
                                                           
                                                           
                                                           
                                                           
                  ▁˛ 🭇,▁🭈🬽                                 
              ▁🭊▟███🭍█████🭌🭍🭑🬼                             
           🭊▅▃🭝🭒🭕🭥🭟🭒█🭝███████▆▆🭏🬼                          
       🭇▃🬿▆🭒▛█🭕█▇▊┕▙🭁█████▇█████▙▆▅▃▁                      
      ©▀▜Ĩ🭪ĸ 🭣,˝¬🭏┲▅`˙▝🭝🭒███▛████████🭀                     
      ▂🬼🮡 ϰ🭗⎺🭆<🭺▅🭩🬿şv▁ 🬿ǮĶ🭔🭧🭞🭝🭧█🭒█🭒███🭌▃🬽🬼                 
   ˛🭺🭝É▀🭼🭷Ì🬽ŀ▞🭆▙🭒🭌█▍🭊🭂🭠🭟🭨▃🭎🮛🭄▙▜🭍🭟🭃▛🭒🭞🭓████▂                
   ┹🮗γ🭮▅🭇🮚🭝▀🭟🭍█🭁▌██▙🭥🭊🭁🭍█▛🭊🭡🭒▃█🭔🭂🭩🭂▂🭨🭃🭞🭨███🭎▖              
    ¨🭉▄■ς🭓2🮛º🭛🭪▛▋🭒🭌█▖🭔🭃🭒🭛🭟🭥🭊🭂▇█🭞▙🭁██🭄█🭂▇▞██🭪▔              
     🭣🭗 🭉🭊🭏■🮀🭨🭠█▛🭎🭃🭕🭜🭃█🭐╲🭄███▜🮀🭃🭂█🭠█🭂▇██🭁🮀'¯               
        ▝▀▀³🭨🭞🭞🭎🭔🭁█🭌▟██🭫▟🭔██🬽🭓███████🭀ĥ🭓🭞🭝🭺                
           🭤🭜▀🭿███🭩🭟🭽▙🭆████▜🭒████🭌🭁🭒🭝🭓⎽                    
              ˝🭘🭭🭕🭝🮖🭝🭁██🭝🭠▀▀▀🭢🭣🭧🭛🭥🭚΄˙                      
                  🭝🭉🭁🭟·                                    
                  ▍██🭎                                     
                ▁🭉🭠🭝██🭏                                    
      ▁,▁🭑▅🭆🭂●■🭫🭜~🬿▞🭔▙█🭌▅▆▅▆▅▂▂▃▂▂▁▁                       
⎽⎽┎▲▇▆🭂█▛🭓█▙🭑ʒ🬿🭁▄🭌🭂███████████████████🭬                    
🭼J🭈🮚🭃À▄▞🮗▇━🭩▇🭝████████████████🭝🭒██▛🭅█🭠΄                    
🭚΅🭣🭭🮗■╉🭔●🭞████🭁████████▜🭝🭕▛▜██🭌▍██🭂█🭟΄                     
▃Ǭ🭺🮛▗🮗🭊█▇█████🭟🭓█🭞🭓██🭒█🬿╲🭕🭣█🭔██▆██🭃█🭗                      
▟🭝🭒▜🭔███🭓🭒█████▇🭌🮗🭂🭞█🭺██🮛Ǣ🭊▜██🭞🮛█🭌█🭡΄                      
▖*▜▼🭌¾▛🭫█🭝██████████🭏🬽🭌█🭎7🮘🭕██▜████▍                       
🭽┗▚🬽🭣▮▔D🬼Ŗ╾Ń🭬🭧🭜▜🭒▆████🭍🭩█🭐🭌▅🭨█🭖████🭏                       
🭷┷ř🮡🭣ª╺🮢🭾ǭ🭣╾🭷🬾▃\²*🭕🭍██████🭍▆🮚🭖🭅█🭐███🭌▏                     
 ˙ 🮡╴🮣🭣🭣Ý¹~╅┿q▄🭪🭍▮🭁🭁▅🬽┩▀🭥🭕🭕🭓██˙🭒█🭧███▍                     
    .🬼¬~` ΄ʻ▔🭥█🭣🭔🭌▉🭪▀🭕🭌▆🬿┺🭦🭏🭝█🭎▖█🭪🭒▚█🭐                     
     '   ·ęw  ╾⎺🭧🮡🭓▉Ņ🭣🭷▜█▆▟█🭎▉█🭪🭤█🬿🭖██🭌🭑                   
          ╺🭆ʒ╼Ĺ·╴ 🮡🬿˜▏΄🭢🭧🭕█🭌█🭂🭒█▆▙΄ψ🭒███▍                  
            🭣ª⎺  ʽ 🭤╲░Þ🬿🭑▇ΆĦ██🬿▆🮀🭕🬿🭢🭫█🭔█▊🬼                 
               ¨ˇ,΄ʽ ¯ħŃ███▃▛🭕🭓█🭐`🭦🭩λ±>▜▟🭌🭑🬼               
                 `       ΄🭧🭒╊ų˜🭦🭝▇🭑🭣ů▁ʽ🭤┻🭣🭒🭧˙              
                      ·     🭥╌ `🭢🭢⎻🭒🭍🬽ª🭢╸ʽ ΄ʻ🭢.            
                                ¨°. ΄΄🭗  ΄ '"  ˆ           
                                      `                    
]]

local right_art = [[
                                                           
                                                           
                        🮣╼*🬼                               
                        🮡 🬿΄                               
                          ▊                                
                         ▏▉                                
                         ▏█                                
                     ⎽⎽_╶╺Ǣ⎻🭷🭷⎺=                           
                    <¨-  ▕ ·`˙ˇ΄                           
                     ˙  ┆ 🭩▖                               
                        🭴 █▌                               
                        🭴 █▌      Ʒ▗🬽                      
                 🭈╼🭷    🭴 █▌    .   🭥🭏🬼                    
                🭉┏🭗 ,ŗ    █▌    ʽ🭣🬿 ʽ🭦🭎🬼                   
               ʻ▐▏ 🭇╱   🭵 █▌  ^🬾  🭤▖ Ť🭔🭐                   
               ▕▉ ╷▐΄🭉╸   █▋  ˛┃ 🮢│🭨 🭲▐█                   
                🭒🬾│▐▏ʻ🭀.🭴 █▍ .j🭛.🭛🭇🭟🮣·🭃▉                   
               ΄🭦🭎▄🭤🭍╅▲╼╸ 🭃🭎🮕🭦🭁🭘┚╏🭁┰ʻ🭮🭨▌                   
               ·΄🭥🮗🭥▇🭩▆🭂▇🭌██🭜🭿🭝🭟🭔🭝🭚^ř▕˜                    
                 .ʽ`΄ ▔▔~⎺▝🭓▀🭧🭓▅▛🭷🮛🭝🭉▞                     
          ▁▁    ·¦˙ ÷΄🮡˙  🮢 🭯;🭿█▗N╱▌╺🭙                     
        ˇ⎺🭧🭓🭘           : ╵˛🭚¯█▙▙🭡🭉▌.                      
          🭵ʻ      , ʽ 🭢  '˛🭴▏ 🭄🭒🭠🭟🭊🭙🭢˛     ⎻━▼🭓🭍━ϕ         
                          ┚╷▐▕▙▇🭋▐╱   ·       ┟Ǵļ🮠         
                        ¨, 🭦🭽▐🭝▉ģ🭠🭗         ˙ 'ŕ           
    ..🭇╾▄▅▃⎽         ·¨   .🭇🭬🭨🭪🭌▝΄           ΄ʽ            
        🭣Ť▕🭠  ˙           🮡 ▌🭨🭡▔🭗                          
        ×🮠"           ·˙  '▕╋🭟🭠΄                           
        ŕ΄             · ╶🮡⎽🭝╺΄                            
        ΄                . ú🭠                              
                          ʻ¦                               
                                                           
                                                           
                                                           
                                                           
                                                           
                                                           
                                                           
                                                           
                                                           
]]

local main_header =  [[
˛                                                ˛
🭦🬿                                              🭇🭡
 🭖🭏🬼  🬼                                       🭇🭆🭟΄
  🭕█🭍🭑🭥🭑🬽🮡🬿     ▚🬽              🭇🭄🭗    🭈┛🭇🭆┛🭊🭂█🭠🭗 
   🭥🭓████▇█🭌▅🬽▁ 🭮█🭍🭑🬽 🭈🬾   🬿 🭇🭆🭂█▋  ▂🭆🭂█▇████🭞🭜   
     🭦█████████🭝┻🭒█████▙  🭄█🭬▜███🭝🭒██🭟🭒█🭟🭕██🭠     
      🭤🭒█████🭓🭕🭎🬼🭃███━▄🮚🬼▐██▆🭁███🭌🭁██🭎🭃█🭌🭁▛🭗      
   ·🬽  🭤███▛🭒🭎🭮█🭐▟██████▙🭋██████🭜▜█████🭞██🭠  ▁🭺   
    🭢🭕▆▅🭁██🭌▅█▙🭒████▛🭓██████🭞🭚🭃█▃🭁█🭫██🭛🭄██🭍▆🭞🭘    
      🭥🭒██████🭌🬿🭥🭧🭓█▀╾`🭕▌🭦🭝🭙╺▀█🭞🭜▀🭈🭃███████🭚      
        🭣🭜▀🭫🭓██▀🭓🭑🬽 ▔   ▘🭤🭗  🭘΄▁🭊■🭜██🭝🭞▀▀🭘΄       
              🭣🭧╴  ▔          ˝΄  🭜🭘΄             
]]


local Options = {
	bigfile = { enabled = true },
	dashboard = {
		enabled = true,
		width = 50,
		row = 3,
		col = 1,
		preset = {
			header = main_header, 
			keys = {
				{ icon = "🔍 ", key = "f", desc = "Find File", action = ":Telescope find_files" },
				{ icon = "📄 ", key = "n", desc = "New File", action = ":ene | startinsert" },
				{ icon = "💬 ", key = "g", desc = "Find Text", action = ":Telescope live_grep" },
				{ icon = "🕒 ", key = "r", desc = "Recent Files", action = ":Telescope oldfiles" },
				{ icon = "⚙️  ", key = "c", desc = "Config", action = ":Telescope find_files cwd=" .. vim.fn.stdpath("config") },
			  { icon = "🔌 ", key = "q", desc = "Quit", action = ":qa" },
			}
		},
		sections = {
			{ 
				pane = 2, 
				section = "header", 
				padding = 1,
			},
			{ 
				pane = 2, 
				section = "keys", 
				padding = 6,
				width = 150 
			},
			{ 
				pane = 2, 
				icon = "↩️ ", 
				title = "Recent Files", 
				section = "recent_files", 
				indent = 4, 
				padding = 1 
			},
			{ 
				pane = 2, 
				icon = "📂 ", 
				title = "Projects", 
				section = "projects",
				indent = 4, 
				padding = 1 
			},
			{ 
				pane = 1, 
				title = left_art,
				indent = 2, 
				padding = 1,
			},
			{ 
				pane = 3,
				title = right_art, 
				indent = 2, 
				padding = 1 
			},
		}
	},
}

return function()
  local snacks = require(PACKAGE_NAME)
  snacks.setup(Options)
end
